In [2]:
import pandas as pd
import numpy as np

# Pandas DataFrame – Practice Exercises

In [3]:
#1.Make a pandas DataFrame with 2D list
lst = [['wvr',59],['pqr',29],['xyz',85],['abc',96]]
df = pd.DataFrame(lst,columns=['Name','Roll No'])
print(df)

  Name  Roll No
0  wvr       59
1  pqr       29
2  xyz       85
3  abc       96

In [48]:
# 2.Creating DataFrame from dict 
data = {
    'Category':['Array','Stack','Queue'],
    'Marks':[20,21,22]
}
df = pd.DataFrame(data)
print(df)

  Category  Marks
0    Array     20
1    Stack     21
2    Queue     22

In [49]:
# 5. Creating dataframe from list of tuples
data = [('A',10,50),('B',12,13),('C',14,30)]
df = pd.DataFrame(data,columns=['name','Age','Score'])
print(df)

  name  Age  Score
0    A   10     50
1    B   12     13
2    C   14     30

In [50]:
# 6. Creating Dataframe from list of dicts
data = [{'A':20,'B':30,'C':30},{
    'A':30,'B':40
}]
df = pd.DataFrame(data)
print(df)

    A   B     C
0  20  30  30.0
1  30  40   NaN

In [51]:
#7. List of nested dictionary initialization
list = [
        {
        "Student": [{"Exam": 90, "Grade": "a"},
                    {"Exam": 99, "Grade": "b"},
                    {"Exam": 97, "Grade": "c"},
                ],
        "Name": "Paras Jain"
        },
        {
        "Student": [{"Exam": 89, "Grade": "a"},
                    {"Exam": 80, "Grade": "b"}
                ],
        "Name": "Chunky Pandey"
        }
    ]
print(list)

[{'Student': [{'Exam': 90, 'Grade': 'a'}, {'Exam': 99, 'Grade': 'b'}, {'Exam': 97, 'Grade': 'c'}], 'Name': 'Paras Jain'}, {'Student': [{'Exam': 89, 'Grade': 'a'}, {'Exam': 80, 'Grade': 'b'}], 'Name': 'Chunky Pandey'}]

In [52]:
# 9. Creating dataframe from series
lst = [10,20,30]
lst1= ['A','B','C']
dfs = pd.Series(lst)
dfs2 = pd.Series(lst1)
dfs3 = {'Author':dfs2,'Articles':dfs}
print(type(dfs))
df = pd.DataFrame(dfs3)
print(df)

<class 'pandas.core.series.Series'>
  Author  Articles
0      A        10
1      B        20
2      C        30

In [53]:
# 12. Reindexing
df = pd.DataFrame(np.random.rand(5,5),columns=['A','B','C','D','E'])
print(df)
df1=df.reindex((['a','b','c','d','e']))
print(df1)

          A         B         C         D         E
0  0.666555  0.310716  0.753391  0.745558  0.130464
1  0.661345  0.368577  0.971015  0.838069  0.201302
2  0.366041  0.944669  0.136477  0.172422  0.504383
3  0.279136  0.426255  0.822400  0.975593  0.592599
4  0.643652  0.147517  0.439184  0.351676  0.530918
    A   B   C   D   E
a NaN NaN NaN NaN NaN
b NaN NaN NaN NaN NaN
c NaN NaN NaN NaN NaN
d NaN NaN NaN NaN NaN
e NaN NaN NaN NaN NaN

In [54]:
# 13.  Mapping external values to dataframe values in pandas
idata = {'first_name':['Ram','Mohan','Tina','Jitu','Meera'],
        'last_name':['Kumar','Sharma','Ali','Gandhi','Kumar'],
        'Age':[32,34,24,32,54],
        'city':['Mumbai','Noida','Pune','Delhi','Bihar']}
df = pd.DataFrame(idata)
print(df)
newdata = {'Ram':'B.com','Mohan':'IAS','Tina':'LLB','Jitu':'B.Tech','Meera':'MBBS'}
df['Qualification']=df['first_name'].map(newdata)
print(df)

  first_name last_name  Age    city
0        Ram     Kumar   32  Mumbai
1      Mohan    Sharma   34   Noida
2       Tina       Ali   24    Pune
3       Jitu    Gandhi   32   Delhi
4      Meera     Kumar   54   Bihar
  first_name last_name  Age    city Qualification
0        Ram     Kumar   32  Mumbai         B.com
1      Mohan    Sharma   34   Noida           IAS
2       Tina       Ali   24    Pune           LLB
3       Jitu    Gandhi   32   Delhi        B.Tech
4      Meera     Kumar   54   Bihar          MBBS

# Pandas Dataframe Rows – Practice Exercise

In [55]:
input_df = [{'name':'Sujeet', 'age':10},
        {'name':'Sameer', 'age':11},
        {'name':'Sumit', 'age':12}]
df = pd.DataFrame(input_df)
print('Original DataFrame: \n', df)

print('\nRows iterated using iterrows() : ')
for index, row in df.iterrows():
    print(row['name'], row['age'])

Original DataFrame:
      name  age
0  Sujeet   10
1  Sameer   11
2   Sumit   12

Rows iterated using iterrows() :
Sujeet 10
Sameer 11
Sumit 12

In [56]:
data = {'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka'],
        'Age': [21, 19, 20, 18],
        'Stream': ['Math', 'Commerce', 'Arts', 'Biology'],
        'Percentage': [88, 92, 95, 70]}
df = pd.DataFrame(data, columns=['Name', 'Age', 'Stream', 'Percentage'])
print("Given Dataframe :\n", df)
print("\nIterating over rows using index attribute :\n")
for ind in df.index:
    print(df['Name'][ind], df['Stream'][ind])

Given Dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95
3   Priyanka   18   Biology          70

Iterating over rows using index attribute :

Ankit Math
Amit Commerce
Aishwarya Arts
Priyanka Biology

In [57]:
record = {
    'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya' ],
    'Age': [21, 19, 20, 18, 17, 21],
    'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
    'Percentage': [88, 92, 95, 70, 65, 78] }

dataframe = pd.DataFrame(record, columns = ['Name', 'Age', 'Stream', 'Percentage'])
print("Given Dataframe :\n", dataframe)
rslt_df = dataframe[dataframe['Percentage'] > 80]
print('\nResult dataframe :\n', rslt_df)

Given Dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

Result dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95

In [58]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/11'],
                'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
                'Cost':[10000, 5000, 15000, 2000]})
Row_list =[]
for i in range((df.shape[0])):
    # Create a list to store the data
    # of the current row
    cur_row =[]
    # iterate over all the columns
    for j in range(df.shape[1]):
        # append the data of each
        # column to the list
        cur_row.append(df.iat[i, j])
    # append the current row to the list
    Row_list.append(cur_row)

print(Row_list[:3])

[['10/2/2011', 'Music', 10000], ['11/2/2011', 'Poetry', 5000], ['12/2/2011', 'Theatre', 15000]]

In [59]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
    'Age':[27, 24, 22, 32],
    'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
    'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
df = pd.DataFrame(data)
print(df.loc[1:3, ['Name', 'Qualification']])

     Name Qualification
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [60]:
df = pd.read_csv('nba.csv')

# First filter out those rows which does not contain any data
df = df.dropna(how = 'all')

# Filter all rows for which the player's age is greater than or equal to 25
df.drop(df[df['Age'] < 25].index, inplace = True)

print(df.head(15))
print(df.shape)

                Name            Team  Number Position   Age Height  Weight  \
0      Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1        Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2       John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
4      Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0
5       Amir Johnson  Boston Celtics    90.0       PF  29.0    6-9   240.0
7       Kelly Olynyk  Boston Celtics    41.0        C  25.0    7-0   238.0
11     Isaiah Thomas  Boston Celtics     4.0       PG  27.0    5-9   185.0
12       Evan Turner  Boston Celtics    11.0       SG  27.0    6-7   220.0
14      Tyler Zeller  Boston Celtics    44.0        C  26.0    7-0   253.0
15  Bojan Bogdanovic   Brooklyn Nets    44.0       SG  27.0    6-8   216.0
17   Wayne Ellington   Brooklyn Nets    21.0       SG  28.0    6-4   200.0
19      Jarrett Jack   Brooklyn Nets     2.0       PG  32.0    6-3   200.0
21   Sean Kilpatrick   Brooklyn Nets     6.0       SG  26.0    6-4   219.0
23       Brook Lopez   Brooklyn Nets    11.0        C  28.0    7-0   275.0
25       Willie Reed   Brooklyn Nets    33.0       PF  26.0   6-10   220.0

              College      Salary
0               Texas   7730337.0
1           Marquette   6796117.0
2   Boston University         NaN
4                 NaN   5000000.0
5                 NaN  12000000.0
7             Gonzaga   2165160.0
11         Washington   6912869.0
12         Ohio State   3425510.0
14     North Carolina   2616975.0
15                NaN   3425510.0
17     North Carolina   1500000.0
19       Georgia Tech   6300000.0
21         Cincinnati    134215.0
23           Stanford  19689000.0
25        Saint Louis    947276.0
(303, 9)

In [61]:
df = pd.DataFrame({'Date':['10/2/2011', '12/2/2011', '13/2/2011', '14/2/2011'],
                'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
                'Cost':[10000, 5000, 15000, 2000]})
print(df)

        Date    Event   Cost
0  10/2/2011    Music  10000
1  12/2/2011   Poetry   5000
2  13/2/2011  Theatre  15000
3  14/2/2011   Comedy   2000

In [62]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/11'],
                'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
                'Cost':[10000, 5000, 15000, 2000]})
print(df)

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3    13/2/11   Comedy   2000

In [63]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/11'],
                'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
                'Cost':[10000, 5000, 15000, 2000]})
print(df)

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3    13/2/11   Comedy   2000

In [64]:
movies = {'Name': ['The Godfather', 'Bird Box', 'Fight Club'],
        'Year': ['1972', '2018', '1999'],
        'Rating': ['9.2', '6.8', '8.8']}
df = pd.DataFrame(movies)
print(df)

            Name  Year Rating
0  The Godfather  1972    9.2
1       Bird Box  2018    6.8
2     Fight Club  1999    8.8

In [65]:
data = {'name': ['Simon', 'Marsh', 'Gaurav', 'Alex', 'Selena'],
    'Maths': [8, 5, 6, 9, 7],
    'Science': [7, 9, 5, 4, 7],
    'English': [7, 4, 7, 6, 8]}
df = pd.DataFrame(data)
a = df.sort_values(by ='Science', ascending = 0)
print("Sorting rows by Science:\n \n", a)

Sorting rows by Science:

      name  Maths  Science  English
1   Marsh      5        9        4
0   Simon      8        7        7
4  Selena      7        7        8
2  Gaurav      6        5        7
3    Alex      9        4        6

In [66]:
dict1 ={'Driver':['Hamilton', 'Vettel', 'Raikkonen',
    'Verstappen', 'Bottas', 'Ricciardo',
    'Hulkenberg', 'Perez', 'Magnussen',
    'Sainz', 'Alonso', 'Ocon', 'Leclerc',
    'Grosjean', 'Gasly', 'Vandoorne',
    'Ericsson', 'Stroll', 'Hartley', 'Sirotkin'],
    'Points':[408, 320, 251, 249, 247, 170, 69, 62, 56, 53, 50, 49, 39, 37, 29, 12, 9, 6, 4, 1],
    'Age':[33, 31, 39, 21, 29, 29, 31, 28, 26, 24, 37, 22, 21, 32, 22, 26, 28, 20, 29, 23]}

df = pd.DataFrame(dict1)
print(df.head(10))

       Driver  Points  Age
0    Hamilton     408   33
1      Vettel     320   31
2   Raikkonen     251   39
3  Verstappen     249   21
4      Bottas     247   29
5   Ricciardo     170   29
6  Hulkenberg      69   31
7       Perez      62   28
8   Magnussen      56   26
9       Sainz      53   24

In [67]:
df = pd.DataFrame({'Name': ['Geeks', 'Peter', 'James', 'Jack', 'Lisa'],
                'Team': ['Boston', 'Boston', 'Boston', 'Chele', 'Barse'],
                'Position': ['PG', 'PG', 'UG', 'PG', 'UG'],
                'Number': [3, 4, 7, 11, 5],
                'Age': [33, 25, 34, 35, 28],
                'Height': ['6-2', '6-4', '5-9', '6-1', '5-8'],
                'Weight': [89, 79, 113, 78, 84],
                'College': ['MIT', 'MIT', 'MIT', 'Stanford', 'Stanford'],
                'Salary': [99999, 99994, 89999, 78889, 87779]},
                index =['ind1', 'ind2', 'ind3', 'ind4', 'ind5'])
print(df, "\n")
print("Check PG values in Position column:\n")
df1 = df['Position'].str.contains("PG")
print(df1)

       Name    Team Position  Number  Age Height  Weight   College  Salary
ind1  Geeks  Boston       PG       3   33    6-2      89       MIT   99999
ind2  Peter  Boston       PG       4   25    6-4      79       MIT   99994
ind3  James  Boston       UG       7   34    5-9     113       MIT   89999
ind4   Jack   Chele       PG      11   35    6-1      78  Stanford   78889
ind5   Lisa   Barse       UG       5   28    5-8      84  Stanford   87779

Check PG values in Position column:

ind1     True
ind2     True
ind3    False
ind4     True
ind5    False
Name: Position, dtype: bool

In [68]:
data = {'Name':["Akash", "Geeku", "Pankaj", "Sumitra","Ramlal"],
'Branch':["B.Tech", "MBA", "BCA", "B.Tech", "BCA"],
'Score':["80","90","60", "30", "50"],
'Result': ["Pass","Pass","Pass","Fail","Fail"]}
df = pd.DataFrame(data)
df

      Name  Branch Score Result
0    Akash  B.Tech    80   Pass
1    Geeku     MBA    90   Pass
2   Pankaj     BCA    60   Pass
3  Sumitra  B.Tech    30   Fail
4   Ramlal     BCA    50   Fail

In [69]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj', 'Geeku'],
'Age':[27, 24, 22, 32, 15],
'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj', 'Noida'],
'Qualification':['Msc', 'MA', 'MCA', 'Phd', '10th']}
df = pd.DataFrame(data)
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd
4   Geeku   15      Noida          10th

# Pandas Dataframe Columns – Practice Exercise

In [70]:
raw_Data = {'Voter_name': ['Geek1', 'Geek2', 'Geek3', 'Geek4',
'Geek5', 'Geek6', 'Geek7', 'Geek8'],
'Voter_age': [15, 23, 25, 9, 67, 54, 42, np.NaN]}
df = pd.DataFrame(raw_Data, columns = ['Voter_name', 'Voter_age'])
eligible = []
for age in df['Voter_age']:
    if age >= 18:              # if Voter eligible
        eligible.append('Yes')
    elif age < 18:             # if voter is not eligible
        eligible.append("No")
    else:
        eligible.append("Not Sure")
df['Voter'] = eligible
print(df)

  Voter_name  Voter_age     Voter
0      Geek1       15.0        No
1      Geek2       23.0       Yes
2      Geek3       25.0       Yes
3      Geek4        9.0        No
4      Geek5       67.0       Yes
5      Geek6       54.0       Yes
6      Geek7       42.0       Yes
7      Geek8        NaN  Not Sure

In [71]:
data = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")
data_top = data.head()
data_top

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [72]:
data = {
'A':['A1', 'A2', 'A3', 'A4', 'A5'],
'B':['B1', 'B2', 'B3', 'B4', 'B4'],
'C':['C1', 'C2', 'C3', 'C3', 'C3'],
'D':['D1', 'D2', 'D2', 'D2', 'D2'],
'E':['E1', 'E1', 'E1', 'E1', 'E1'] }
df = pd.DataFrame(data)
df.B.unique()

array(['B1', 'B2', 'B3', 'B4'], dtype=object)

In [73]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
'Product':['Umbrella', 'Matress', 'Badminton', 'Shuttle'],
'Last Price':[1200, 1500, 1600, 352],
'Updated Price':[1250, 1450, 1550, 400],
'Discount':[10, 10, 10, 10]})
print(df)

        Date    Product  Last Price  Updated Price  Discount
0  10/2/2011   Umbrella        1200           1250        10
1  11/2/2011    Matress        1500           1450        10
2  12/2/2011  Badminton        1600           1550        10
3  13/2/2011    Shuttle         352            400        10

In [74]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
'Cost':[10000, 5000, 15000, 2000]})
print(df)

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3  13/2/2011   Comedy   2000

In [75]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
'Cost':[10000, 5000, 15000, 2000]})
print(df)

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3  13/2/2011   Comedy   2000

In [76]:
df = pd.DataFrame({'A': ['foo', 'bar', 'g2g', 'g2g', 'g2g',
'bar', 'bar', 'foo', 'bar'],
'B': ['a', 'b', 'a', 'b', 'b', 'b', 'a', 'a', 'b'] })
count = df['A'].value_counts()
print(count)

bar    4
g2g    3
foo    2
Name: A, dtype: int64

In [77]:
df1 = { 'Name':['George','Andrea','micheal',
'maggie','Ravi','Xien','Jalpa'],
'score1':[62,47,55,74,32,77,86],
'score2':[45,78,44,89,66,49,72]}
df1 = pd.DataFrame(df1,columns= ['Name','score1','score2'])
print("Given Dataframe :\n", df1)
df1['Score_diff'] = df1['score1'] - df1['score2']
print("\nDifference of score1 and score2 :\n", df1)

Given Dataframe :
       Name  score1  score2
0   George      62      45
1   Andrea      47      78
2  micheal      55      44
3   maggie      74      89
4     Ravi      32      66
5     Xien      77      49
6    Jalpa      86      72

Difference of score1 and score2 :
       Name  score1  score2  Score_diff
0   George      62      45          17
1   Andrea      47      78         -31
2  micheal      55      44          11
3   maggie      74      89         -15
4     Ravi      32      66         -34
5     Xien      77      49          28
6    Jalpa      86      72          14

In [78]:
data = {
'A': ['A1', 'A2', 'A3', 'A4', 'A5'],
'B': ['B1', 'B2', 'B3', 'B4', 'B5'],
'C': ['C1', 'C2', 'C3', 'C4', 'C5'],
'D': ['D1', 'D2', 'D3', 'D4', 'D5'],
'E': ['E1', 'E2', 'E3', 'E4', 'E5']}
df = pd.DataFrame(data)
df

    A   B   C   D   E
0  A1  B1  C1  D1  E1
1  A2  B2  C2  D2  E2
2  A3  B3  C3  D3  E3
3  A4  B4  C4  D4  E4
4  A5  B5  C5  D5  E5

In [79]:
data = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")
data_top = data.head(10)
data_top

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

# Pandas Series – Practice Exercise

In [80]:
# create pandas series from array
data = np.array(['a','b','c','d'])
s = pd.Series(data)
print(s)

0    a
1    b
2    c
3    d
dtype: object

In [81]:
# Creating pandas series from dictionary
d = {
    'A':10,
    'B':20,
    'C':30,
    'D':40
}
s = pd.Series(d)
print(s)

A    10
B    20
C    30
D    40
dtype: int64

In [82]:
# Creating pandas series from list
lst = [10,20,30,40,50,60]
s = pd.Series(lst)
print(s)

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [83]:
#create pandas series using numpy functions
s1 = pd.Series(np.linspace(3,33,7))
s2 = pd.Series(np.linspace(1,50,10))
print(s1)
print(s2)

0     3.0
1     8.0
2    13.0
3    18.0
4    23.0
5    28.0
6    33.0
dtype: float64
0     1.000000
1     6.444444
2    11.888889
3    17.333333
4    22.777778
5    28.222222
6    33.666667
7    39.111111
8    44.555556
9    50.000000
dtype: float64

In [84]:
# Access elements series in padas
df = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")
s = pd.Series(df['Name'])
print(s)

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457              NaN
Name: Name, Length: 458, dtype: object

# Pandas Date and Time – Practice Exercise

In [85]:
from datetime import datetime
range_date = pd.date_range(start='1/1/2000',end='1/8/2000',freq='Min')
print(range_date)

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 00:01:00',
               '2000-01-01 00:02:00', '2000-01-01 00:03:00',
               '2000-01-01 00:04:00', '2000-01-01 00:05:00',
               '2000-01-01 00:06:00', '2000-01-01 00:07:00',
               '2000-01-01 00:08:00', '2000-01-01 00:09:00',
               ...
               '2000-01-07 23:51:00', '2000-01-07 23:52:00',
               '2000-01-07 23:53:00', '2000-01-07 23:54:00',
               '2000-01-07 23:55:00', '2000-01-07 23:56:00',
               '2000-01-07 23:57:00', '2000-01-07 23:58:00',
               '2000-01-07 23:59:00', '2000-01-08 00:00:00'],
              dtype='datetime64[ns]', length=10081, freq='T')

In [86]:
df = pd.DataFrame({'City':['Lisbon','Parague','Macao','Venice'],
                  'Event':['Music','Poetry','Theature','Comedy'],
                  'Cost':[10000,5000,15000,2000]})
index_ = [pd.Timestamp('01-06-2018'),pd.Timestamp('04-06-2018'),pd.Timestamp('07-06-2018'),pd.Timestamp('10-06-2018')]
df.index= index_
print(df)

               City     Event   Cost
2018-01-06   Lisbon     Music  10000
2018-04-06  Parague    Poetry   5000
2018-07-06    Macao  Theature  15000
2018-10-06   Venice    Comedy   2000

In [87]:
df = pd.DataFrame({'Date':['11/8/2011', '04/23/2008', '10/2/2019'],
                   'Event':['Music', 'Poetry', 'Theatre'],
                   'Cost':[10000, 5000, 15000]})
print(df)
df.info()

         Date    Event   Cost
0   11/8/2011    Music  10000
1  04/23/2008   Poetry   5000
2   10/2/2019  Theatre  15000
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    3 non-null      object
 1   Event   3 non-null      object
 2   Cost    3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes